Repository: fossabot/Obsidion
Catalog: obsidion/core/locales/*.po
Languages: da_dk, ja_jp

source: Commands related to core functions.
da_dk: Kommandoer med relation til kernefunktioner.
ja_jp: コア機能に関連したコマンド

source: Pong.
ja_jp: ポン・・・

source: Shows info about Obsidion.
da_dk: Viser info om Obsidion.
ja_jp: 監視者に関する情報を表示します。

source: This bot is an instance of [Obsidion, an open source Discord bot]({}) created by [Darkflame72]({}) and [improved by many]({}). Obsidion is backed by a passionate community who contributes and creates content for everyone to enjoy. [Join us today]({}) and help us improve! (c) Obsidion-dev
da_dk: Denne robot er en forekomst af [ Obsidion, en open source Discord bot ] ({ }) oprettet af [Darkflame72]({ }) og [ forbedret af mange ] ({ }). Obsidion er understøttet af et passioneret fællesskab, som bidrager til og opretter indhold, som alle kan nyde godt af. [ Deltag i dag ] ({ }) og hjælpe os med at forbedre! (c) Obsidion-dev
ja_jp: このボットは、 [Darkflame72]({}) によって作成され、 [{ }]によって改良された [ Ob曜石] ( オープンソースのディスコードボット ) のインスタンスです。 黒曜は、誰もが楽しむコンテンツを提供する情熱的なコミュニティによって支援されている。 [ 今日は私たちに参加 ]({}) 、お手伝いをします。 (c) オブシオン・オン・デヴ

source: Bringing joy since 23rd March 2020 (over {} days ago!)
da_dk: Bringer glæden siden den 23. marts 2020 (over { } dage siden!)
ja_jp: 2020 年 3 月 23 日 ( { } 日前!) 以降、喜びをお楽しみください。

source: Shows Obsidion's uptime.
da_dk: Viser Obsidion's oppetid.
ja_jp: 監視者のアップタイムを表示します。

source: Less than one second
da_dk: Mindre end et sekund
ja_jp: 1 秒未満

source: Been up for: **{time_quantity}** (since {timestamp} UTC)
da_dk: Har været op til: **{time_quantity}** (siden {timestamp} UTC)
ja_jp: **{time_quantity}** ( {timestamp} UTCより )

source: Invite the bot to your server.
da_dk: Invitér botten til din server.
ja_jp: ボットをサーバーに招待します。

source: You can invite {name} to your Discord server by [clicking here]({invite}).
da_dk: Du kan invitere {name} til din Discord-server ved at [ klikke her ] ({invite}).
ja_jp: [ ここをクリック ] ({invite} )を使用して、 {name} をご使用の Discord サーバーに送信できます。

source: Leaves the current server.
da_dk: Efterlader den aktuelle server.
ja_jp: 現在のサーバーを保存します。

source: Are you sure you want me to leave this server? (y/n)
ja_jp: このサーバーから移動してもよろしいですか ? (y/n)

source: Response timed out.
da_dk: Tidsfristen for svar er udløbet.
ja_jp: 応答がタイムアウトしました。

source: Alright. Bye :wave:
da_dk: Fint nok. Bye :wave:
ja_jp: よし。 バイ :wave:

source: Leaving guild '{}'
da_dk: Forlader guild '{ }'
ja_jp: ギルド '{}' を終了している

source: Alright, I'll stay then. :)
da_dk: Okay, så bliver jeg der. :)
ja_jp: よし、私はそこにいる。 :)

source: Lists and allows [botname] to leave servers.
ja_jp: [botname] のリストを表示し、サーバーを終了します。

source: To leave a server, just type its number.
da_dk: Hvis du vil forlade en server, skal du bare skrive nummeret.
ja_jp: サーバーを終了するには、サーバーの番号を入力します。

source: I cannot leave a guild I am the owner of.
ja_jp: 私は自分が所有者であるギルドを残すことはできない。

source: Are you sure you want me to leave {}? (yes/no)
da_dk: Er du sikker på, at du vil have mig til at forlade { }? (ja/nej)
ja_jp: {}を終了してもよろしいですか ? (yes/no)

source: Done.
da_dk: Klaret.
ja_jp: 完了しました。

source: Alright then.
ja_jp: よし

source: Get info about Obsidion's licenses.
da_dk: Få oplysninger om Obsidion's licenser.
ja_jp: Ob曜石のライセンスに関する情報を取得します。

source: This bot is an instance of the Obsidion Discord Bot. Obsidion is an open source application made available to the public and licensed under the GNU AGPL v3. The full text of this license is available to you at <https://github.com/Obsidion-dev/Obsidion/blob/master/LICENSE>
da_dk: Denne bot er en forekomst af Obsidion Discord Bot. Obsidion er en åben kildeapplikation, der stilles til rådighed for offentligheden og licenseret i henhold til GNU-AGPL v3. Den fuldstændige tekst til denne licens er tilgængelig for dig på <https://github.com/Obsidion-dev/Obsidion/blob/master/LICENSE>
ja_jp: このボットは、 Ob曜石のインスタンスであり、一般公開され、 GNU AGPL v3 でライセンスされたオープンソースのアプリケーションである。 このライセンスの全文は、 <https://github.com/Obsidion-dev/Obsidion/blob/master/LICENSE> までご利用いただけます。

source: Displays my full source code or for a specific command. To display the source code of a subcommand you can separate it by periods, e.g. account.link for the link subcommand of the account command or by spaces.
da_dk: Viser min fulde kildekode eller for en bestemt kommando. For at få vist kildekoden for en underkommando, kan du adskille det med perioder, f.eks. account.link for link subkommandoen of the account command eller med mellemrum.
ja_jp: 完全なソース・コードを表示するか、特定のコマンドを表示します。 サブコマンドのソース・コードを表示するには、 ピリオドで区切ることができます。例えば、アカウント・コマンド のリンク・サブコマンドの account.link 、またはスペースを使用します。

source: Shuts down the bot.
da_dk: Lukker robotten ned.
ja_jp: ボットをシャットダウンします。

source: Attempts to restart Obsidion. Makes [botname] quit with exit code 26. The restart is not guaranteed: it must be dealt with by the process manager in use.
ja_jp: Obsidionを再始動しようとしました。 Makes [botname] は終了コード 26 で終了します。 再始動は保証されていません。プロセス・マネージャーが使用中の を処理する必要があります。

source: Sends to the owner the last command exception that has occurred. If public (yes is specified), it will be sent to the chat instead.
da_dk: Sender til ejeren den sidste kommando-undtagelse, der er opstået. Hvis offentlig (ja er angivet), bliver den sendt til chatten i stedet for.
ja_jp: 実行された最後のコマンド例外を所有者に送信します。 パブリック (「はい」が指定されている場合 ) は、代わりにチャットに送信されます。

source: I couldn't send the traceback message to you in DM. Either you blocked me or you disabled DMs in this server.
da_dk: Jeg kunne ikke sende den sporende besked til dig i DM. Enten har du blokeret mig, eller også har du deaktiveret DM ' er på denne server.
ja_jp: DMではトレースバックのメッセージを送ることができなかった。 このサーバーでは、あなたが私をブロックしたか、またはこのサーバーで DMs

source: No exception has occurred yet.
da_dk: Der er ikke opstået en undtagelse endnu.
ja_jp: 例外はまだ発生していません。

source: Changes Obsidion's settings.
ja_jp: 黒曜の設定を変更します。

source: Sets a default colour to be used for the bot's embeds. Acceptable values for the colour parameter can be found at: https://discordpy.readthedocs.io/en/stable/ext/commands/api.html#discord.ext.commands.ColourConverter
ja_jp: ボットの埋め込みに使用されるデフォルト色を設定します。 カラー・パラメーターの受け入れ可能な値は、 https://discordpy.readthedocs.io/en/stable/ext/commands/api.html#discord.ext.commands.ColourConverter にあります。

source: The color has been reset.
ja_jp: 色がリセットされました。

source: The color has been set.
ja_jp: 色が設定されました。

source: Sets [botname]'s avatar Supports either an attachment or an image URL.
ja_jp: [botname]'s アバター を設定すると、添付ファイルまたはイメージ URL のいずれかをサポートします。

source: That URL is invalid.
ja_jp: その URL は無効です。

source: Something went wrong while trying to get the image.
ja_jp: 画像を撮ろうとして何か問題が発生しました。

source: Failed. Remember that you can edit my avatar up to two times a hour. The URL or attachment must be a valid image in either JPG or PNG format.
ja_jp: 失敗。 私のアバターを 1 時間に 2 回まで編集できることに注意してください。 URL または添付ファイルは、 JPG 形式または PNG 形式のいずれかの有効なイメージでなければなりません。

source: JPG / PNG format only.
ja_jp: JPG / PNG 形式のみ。

source: Removes [botname]'s avatar.
ja_jp: [botname]' s アバターを除去します。

source: Avatar removed.
ja_jp: アバターを除去。

source: Sets [botname]'s playing status.
ja_jp: [botname]の再生状況を設定します。

source: Status set to ``Playing {game.name}``.
ja_jp: 状況は「 {game.name} 」に設定されている。

source: Game cleared.
ja_jp: ゲームは晴れた

source: Sets [botname]'s listening status.
ja_jp: [botname]' の listen 状況を設定します。

source: Status set to ``Listening to {listening}``.
ja_jp: 状況は「 {listening} までをリスニング」に設定されている。

source: Listening cleared.
ja_jp: listen をクリアしました。

source: Sets [botname]'s watching status.
ja_jp: [botname]'の監視状況を設定します。

source: Status set to ``Watching {watching}``.
ja_jp: 状況は「ウォッチ {watching} 」に設定されている。

source: Watching cleared.
ja_jp: ウォッチをクリアしました。

source: Sets [botname]'s competing status.
ja_jp: [botname]'の競合状況を設定します。

source: Status set to ``Competing in {competing}``.
ja_jp: 状況は「 {competing} 」に設定されている。

source: Competing cleared.
ja_jp: 競合が解消されました

source: Sets [botname]'s status. Available statuses: online idle dnd invisible
ja_jp: [botname]'の状況を設定します。 使用可能な状況: オンライン アイドル・アイドル dnd ( 非表示 )

source: Status changed to {}.
ja_jp: 状況が {}に変わりました。

source: Sets [botname]'s streaming status. Leaving both streamer and stream_title empty will clear it.
ja_jp: [botname]'のストリーミング状況を設定します。 両方のストリーマーとストリーム・タイトルを空にしておくと、それがクリアされます。

source: Sets Obsidion's nickname.
da_dk: Sets Obsidions kælenavn.
ja_jp: 黒曜石のニックネームを設定します。

source: Failed to change nickname. Must be 32 characters or fewer.
da_dk: Kan ikke ændre kaldenavn. Der må være 32 tegn eller færre.
ja_jp: ニックネームを変更できません。 32 文字以下でなければなりません。

source: I lack the permissions to change my own nickname.
da_dk: Jeg har ikke tilladelserne til at ændre mit eget kælenavn.
ja_jp: 自分のニックネームを変更する許可がない。

source: Sets Obsidion's global prefix(es).
ja_jp: Obsidionのグローバル接頭部を設定します。

source: Prefix set.
da_dk: Præfiks indstillet.
ja_jp: 接頭部セット。

source: Sets Obsidion's server prefix(es).
da_dk: Sets Obsidions serverpræfiks (es).
ja_jp: Obsidionのサーバー接頭部を設定します。

source: Guild prefixes have been reset.
da_dk: Guild præfikser er nulstillet.
ja_jp: ギルド接頭部がリセットされました。

source: Sends a DM to a user. This command needs a user ID to work. To get a user ID, go to Discord's settings and open the 'Appearance' tab. Enable 'Developer Mode', then right click a user and click on 'Copy ID'.
ja_jp: DM をユーザーに送信します。 このコマンドには、作業するユーザー ID が必要です。 ユーザー IDを取得するには、「ディスコード」の設定に進み、 「外観」タブを開きます。 「開発者モード」を有効にしてから、 ユーザーを右クリックし、「コピー ID」をクリックします。

source: Invalid ID, user not found, or user is a bot. You can only send messages to people I share a server with.
ja_jp: IDが無効であるか、ユーザーが見つからないか、ユーザーがボットです。 メッセージは、サーバーを共有しているユーザーにのみ送信できます。

source: Owner of {}
ja_jp: {} の所有者

source: You can reply to this message with {}contact
ja_jp: このメッセージに {}連絡先で返信することができます

source: Sorry, I couldn't deliver your message to {}
ja_jp: 申し訳ありません。 {} にメッセージを配信できませんでした

source: Message delivered to {}
ja_jp: { } に配信されるメッセージ

source: Development Commands.
da_dk: Udviklingskommandoer.
ja_jp: 開発コマンド。

source: Loads a module.
da_dk: Indlæser et modul.
ja_jp: モジュールをロードします。

source: The cog `{module}` has been succesfully loaded
da_dk: Kogge "{module}" er blevet indlæst
ja_jp: コグ '{module}' が正常にロードされました

source: Unloads a module.
da_dk: Udlæser et modul.
ja_jp: モジュールをアンロードします。

source: The cog `{module}` has been succesfully unloaded
da_dk: Kogge "{module}" er blevet aflæsset.
ja_jp: コグ '{module}' が正常にアンロードされました。

source: Reloads a module.
da_dk: Genindlæser et modul.
ja_jp: モジュールを再ロードします。

source: The cog `{module}` has been succesfully reloaded
da_dk: Cog `{module}` er blevet genindlæst
ja_jp: コグ '{module}' は正常に再ロードされた

source: Evaluate a statement of python code. The bot will always respond with the return value of the code. If the return value of the code is a coroutine, it will be awaited, and the result of that will be the bot's response. Note: Only one statement may be evaluated. Using certain restricted keywords, e.g. yield, will result in a syntax error. For multiple lines or asynchronous code, see [p]repl or [p]eval. Environment Variables: ctx - command invocation context bot - bot object channel - the current channel object author - command author's member object message - the command's message object discord - discord.py library commands - redbot.core.commands _ - The result of the last dev command.
ja_jp: python コードのステートメントを評価します。 ボットは、コードの戻り値で常に応答します。 コードの戻り値がコロティンである場合は、 というコードが待っており、その結果がボットの応答になります。 注: 評価できるのは 1 つのステートメントのみです。 特定の制限された キーワード( 例えば、利回り) を使用すると、構文エラーが発生します。 複数の 行または非同期コードの場合は、 [p]repl または [p]の evalを参照してください。 環境変数: ctx - コマンド呼び出しコンテキスト ボット・ボット・オブジェクト チャネル - 現在のチャネル・オブジェクト 作成者 - コマンド作成者のメンバー・オブジェクト メッセージ - コマンドのメッセージ・オブジェクト discord.discord.py ライブラリー コマンド - redbot.core.command _ - 最後の dev コマンドの結果。

source: Execute asynchronous code. This command wraps code into the body of an async function and then calls and awaits it. The bot will respond with anything printed to stdout, as well as the return value of the function. The code can be within a codeblock, inline code or neither, as long as they are not mixed and they are formatted correctly. Environment Variables: ctx - command invocation context bot - bot object channel - the current channel object author - command author's member object message - the command's message object discord - discord.py library commands - redbot.core.commands _ - The result of the last dev command.
ja_jp: 非同期コードを実行する このコマンドは、コードを非同期関数の本体にラップし、次に 呼び出しを呼び出し、それを待機します。 このボットは、 stdout に印刷されたものと、関数の戻り値に対応するものを応答する。 コードは、コードが混在せず、また の長さが正しくフォーマットされておらず、コードがコード化されているインライン・コード内にある場合があります。 環境変数: ctx - コマンド呼び出しコンテキスト ボット・ボット・オブジェクト チャネル - 現行チャネル・オブジェクト 作成者 - コマンド作成者のメンバー・オブジェクト メッセージ - コマンドのメッセージ・オブジェクト コマンド - discord.discord.py ライブラリー _ - コマンド _ - コマンド _ - コマンド _ コマンドの結果。最後の dev コマンドの結果。

source: Open an interactive REPL. The REPL will only recognise code as messages which start with a backtick. This includes codeblocks, and as such multiple lines can be evaluated.
da_dk: Åbn en interaktiv REPL. REPL vil kun genkende kode som meddelelser, der starter med en backtick. Dette inkluderer kodeblokke, og som sådan flere linjer kan være evalueret.
ja_jp: 対話式 REPLを開きます。 REPL は、 バックティックで始まるメッセージとしてのコードのみを認識します。 これにはコデロックが含まれ、そのような複数行には が評価されます。

source: Already running a REPL session in this channel. Exit it with `quit`.
da_dk: Der udføres allerede en REPL-session i denne kanal. Afslut det med "stop".
ja_jp: このチャネルで REPL セッションを実行中です。 「 quit」で終了します。

source: Already running a REPL session in this channel. Resume the REPL with `{}repl resume`.
da_dk: Der udføres allerede en REPL-session i denne kanal. Genoptag REPL med ` { } repl-CV '.
ja_jp: このチャネルで REPL セッションを実行中です。 「 {}repl 再開」を指定して REPL を再開しています。

source: Enter code to execute or evaluate. `exit()` or `quit` to exit. `{}repl pause` to pause.
da_dk: Angiv kode, der skal udføres eller evalueres. "exit ()") "eller" er stoppet " til afkørsel. "{ } repl pause" til pause.
ja_jp: 実行または評価するコードを入力します。 終了するには「exit()」または「 quit」と入力します。 `{}repl 休止を休止します。

source: Pauses/resumes the REPL running in the current channel
da_dk: Pauses / genoptager resuméer af REPL, der kører på den aktuelle kanal
ja_jp: 現行チャネルで実行中の REPL を一時停止/再開します。

source: There is no currently running REPL session in this channel.
da_dk: Der er ingen igangværende REPL-session i denne kanal.
ja_jp: このチャネルには現在実行中の REPL セッションがありません。

source: The REPL session in this channel has been resumed.
da_dk: REPL-sessionen i denne kanal er genoptaget.
ja_jp: このチャネルの REPL セッションが再開されました。

source: The REPL session in this channel is now paused.
da_dk: REPL-sessionen i denne kanal er midlertidigt stoppet.
ja_jp: このチャネルの REPL セッションが一時停止されました。

source: Mock another user invoking a command. The prefix must not be entered.
da_dk: Mock en anden bruger, der starter en kommando. Præfikset må ikke angives.
ja_jp: 別のユーザーがコマンドを起動するようにします。 接頭部を入力してはいけません。

source: Dispatch a message event as if it were sent by a different user. Only reads the raw content of the message. Attachments, embeds etc. are ignored.
da_dk: Afsend en meddelelseshændelse, som om den er sendt af en anden bruger. Det er kun beskedens ubehandlede indhold, der er behandlet. Vedhæftninger, underslæb osv. er ignoreret.
ja_jp: メッセージ・イベントが別のユーザーによって送信されたかのようにディスパッチされます。 メッセージの未加工コンテンツのみを読み取ります。 添付、組み込みなどは、 では無視されます。

source: Important bot events.
da_dk: Vigtige robotbegivenheder.
ja_jp: 重要なボット・イベント。

source: I require the {permission} permission to execute that command.
da_dk: Jeg har brug for den {permission} tilladelse til at udføre denne kommando.
ja_jp: このコマンドを実行するには、 {permission} 許可が必要です。

source: This command is on cooldown. Try again in {delay}.
da_dk: Denne kommando er på kølerned. Prøv igen i {delay}.
ja_jp: このコマンドはクールダウンされます。 {delay} で再試行してください。

source: This command is on cooldown. Try again in 1 second.
da_dk: Denne kommando er på kølerned. Prøv igen om 1 sekund.
ja_jp: このコマンドはクールダウンされます。 1 秒後に再試行してください。

source: Too many people using this command. It can only be used {number} times concurrently.
da_dk: Der er for mange, der bruger denne kommando. Den kan kun bruges på {number} gange samtidigt.
ja_jp: このコマンドを使用する人が多すぎます 同時に使用することができるのは、 {number} 回のみです。

source: Too many people using this command. It can only be used once concurrently.
da_dk: Der er for mange, der bruger denne kommando. Den kan kun bruges én gang i øjeblikket.
ja_jp: このコマンドを使用する人が多すぎます 同時に使用できるのは 1 回だけです。

source: That command is still completing, it can only be used {number} times per {type} concurrently.
da_dk: Den kommando er stadig i gang, den kan kun bruges {number} gange pr. {type} samtidigt.
ja_jp: このコマンドはまだ完了していませんが、 {number} 回 ( {type} ) でしか使用できません。

source: That command is still completing, it can only be used once per {type} concurrently.
da_dk: Kommandoen er stadig i gang, den kan kun bruges én gang pr. {type} samarbejder.
ja_jp: このコマンドはまだ完了していますが、 {type} の同時使用時に 1 回しか使用できません。

source: Too many people using this command. It can only be used {number} times per {type} concurrently.
da_dk: Der er for mange, der bruger denne kommando. Den kan kun bruges {number} gange pr. {type} samnuværende.
ja_jp: このコマンドを使用する人が多すぎます {number} 回 ( {type} ) でしか使用できない。

source: Too many people using this command. It can only be used once per {type} concurrently.
da_dk: Der er for mange, der bruger denne kommando. Den kan kun bruges én gang pr. {type} samtidigt.
ja_jp: このコマンドを使用する人が多すぎます これは、 {type} の同時使用時に 1 回のみ使用できます。
